ApacheBench-ab/data/ab_init_6.log
This is ApacheBench, Version 2.3 <$Revision$>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.176.22.211 (be patient).....done


Server Software:        nginx/1.8.1
Server Hostname:        10.176.22.211
Server Port:            80

Document Path:          
                       /VOD4K/Test_track17.8.mp4
                       /VOD4K/Test_track18.8.mp4
                       /VOD4K/Test_track19.8.mp4
                       /VOD4K/Test_track20.8.mp4
                       /VOD4K/Test_track29.8.mp4
                       /VOD4K/Test_track30.8.mp4
                       /VOD4K/Test_track31.8.mp4
                       /VOD4K/Test_track32.8.mp4
                       /VOD4K/Test_track41.8.mp4
                       /VOD4K/Test_track42.8.mp4
                       /VOD4K/Test_track43.8.mp4
                       /VOD4K/Test_track44.8.mp4
                       /VOD4K/Test_track53.8.mp4
                       /VOD4K/Test_track54.8.mp4
                       /VOD4K/Test_track55.8.mp4
                       /VOD4K/Test_track56.8.mp4
                       /VOD4K/Test_track73.8.mp4
                       /VOD4K/Test_track74.8.mp4
                       /VOD4K/Test_track75.8.mp4
                       /VOD4K/Test_track76.8.mp4
Document Length:        2759526 bytes

Concurrency Level:      6
Time taken for tests:   0.009 seconds, 8701.000000 us
Complete requests:      6
Failed requests:        0
Write errors:           0
Keep-Alive requests:    6
Total transferred:      2788278 bytes
HTML transferred:       2759526 bytes
Requests per second:    689.58 [#/sec] (mean)
Time per request:       8.701 [ms] (mean)
Time per request:       1.450 [ms] (mean, across all concurrent requests)
Transfer rate:          312944.23 [Kbytes/sec] received
connect:191, process:6218, wait:4761, total:6409, transfer:1457
connect:185, process:6836, wait:5334, total:7021, transfer:1502
connect:214, process:6957, wait:5387, total:7171, transfer:1570
connect:209, process:7260, wait:5625, total:7469, transfer:1635
connect:196, process:7302, wait:5399, total:7498, transfer:1903
connect:203, process:8348, wait:6697, total:8551, transfer:1651
@MEASUREMENT(requests = 1, concurrency = 6):
AVERAGE = 6957.00 us
50 TAIL = 6957.00 us
99 TAIL = 6957.00 us
99.9 TAIL = 6957.00 us
99.99 TAIL = 6957.00 us
@MEASUREMENT(requests = 1, concurrency = 6):
AVERAGE = 7259.00 us
50 TAIL = 7259.00 us
99 TAIL = 7259.00 us
99.9 TAIL = 7259.00 us
99.99 TAIL = 7259.00 us
@MEASUREMENT(requests = 1, concurrency = 6):
AVERAGE = 8348.00 us
50 TAIL = 8348.00 us
99 TAIL = 8348.00 us
99.9 TAIL = 8348.00 us
99.99 TAIL = 8348.00 us
@MEASUREMENT(requests = 1, concurrency = 6):
AVERAGE = 7302.00 us
50 TAIL = 7302.00 us
99 TAIL = 7302.00 us
99.9 TAIL = 7302.00 us
99.99 TAIL = 7302.00 us
@MEASUREMENT(requests = 1, concurrency = 6):
AVERAGE = 6218.00 us
50 TAIL = 6218.00 us
99 TAIL = 6218.00 us
99.9 TAIL = 6218.00 us
99.99 TAIL = 6218.00 us
@MEASUREMENT(requests = 1, concurrency = 6):
AVERAGE = 6836.00 us
50 TAIL = 6836.00 us
99 TAIL = 6836.00 us
99.9 TAIL = 6836.00 us
99.99 TAIL = 6836.00 us

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      185  199   0.0    203     214
Processing:  6218 7153   0.7   7260    8348
Waiting:     4761 5533   0.6   5399    6697
Total:       6409 7353   0.7   7469    8551
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the processing time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the waiting time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the total time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      7
  80%      7
  90%      9
  95%      9
  98%      9
  99%      9
 100%      9 (longest request)